Simsoniteee/TestRepo/F2837x_spi_tlc549/device/driverlib/inc/hw_sysctl.h
//*****************************************************************************
//
// The following are defines for the bit fields in the DC8 register
//
//*****************************************************************************
#define SYSCTL_DC8_SCI_A          0x1U         // SCI_A
#define SYSCTL_DC8_SCI_B          0x2U         // SCI_B
#define SYSCTL_DC8_SCI_C          0x4U         // SCI_C
#define SYSCTL_DC8_SCI_D          0x8U         // SCI_D

//*****************************************************************************
//
// The following are defines for the bit fields in the DC9 register
//
//*****************************************************************************
#define SYSCTL_DC9_SPI_A          0x1U         // SPI_A
#define SYSCTL_DC9_SPI_B          0x2U         // SPI_B
#define SYSCTL_DC9_SPI_C          0x4U         // SPI_C

//*****************************************************************************
//
// The following are defines for the bit fields in the DC10 register
//
//*****************************************************************************
#define SYSCTL_DC10_I2C_A         0x1U         // I2C_A
#define SYSCTL_DC10_I2C_B         0x2U         // I2C_B

//*****************************************************************************
//
// The following are defines for the bit fields in the DC11 register
//
//*****************************************************************************
#define SYSCTL_DC11_CAN_A         0x1U         // CAN_A
#define SYSCTL_DC11_CAN_B         0x2U         // CAN_B

//*****************************************************************************
//
// The following are defines for the bit fields in the DC12 register
//
//*****************************************************************************
#define SYSCTL_DC12_MCBSP_A       0x1U         // McBSP_A
#define SYSCTL_DC12_MCBSP_B       0x2U         // McBSP_B
#define SYSCTL_DC12_USB_A_S       16U
#define SYSCTL_DC12_USB_A_M       0x30000U     // Decides the capability of the
                                               // USB_A Module

//*****************************************************************************
//
// The following are defines for the bit fields in the DC13 register
//
//*****************************************************************************
#define SYSCTL_DC13_UPP_A         0x1U         // uPP_A

//*****************************************************************************
//
// The following are defines for the bit fields in the DC14 register
//
//*****************************************************************************
#define SYSCTL_DC14_ADC_A         0x1U         // ADC_A
#define SYSCTL_DC14_ADC_B         0x2U         // ADC_B
#define SYSCTL_DC14_ADC_C         0x4U         // ADC_C
#define SYSCTL_DC14_ADC_D         0x8U         // ADC_D

//*****************************************************************************
//
// The following are defines for the bit fields in the DC15 register
//
//*****************************************************************************
#define SYSCTL_DC15_CMPSS1        0x1U         // CMPSS1
#define SYSCTL_DC15_CMPSS2        0x2U         // CMPSS2
#define SYSCTL_DC15_CMPSS3        0x4U         // CMPSS3
#define SYSCTL_DC15_CMPSS4        0x8U         // CMPSS4
#define SYSCTL_DC15_CMPSS5        0x10U        // CMPSS5
#define SYSCTL_DC15_CMPSS6        0x20U        // CMPSS6
#define SYSCTL_DC15_CMPSS7        0x40U        // CMPSS7
#define SYSCTL_DC15_CMPSS8        0x80U        // CMPSS8

//*****************************************************************************
//
// The following are defines for the bit fields in the DC17 register
//
//*****************************************************************************
#define SYSCTL_DC17_DAC_A         0x10000U     // Buffered-DAC_A
#define SYSCTL_DC17_DAC_B         0x20000U     // Buffered-DAC_B
#define SYSCTL_DC17_DAC_C         0x40000U     // Buffered-DAC_C

//*****************************************************************************
//
// The following are defines for the bit fields in the DC18 register
//
//*****************************************************************************
#define SYSCTL_DC18_LS0_1         0x1U         // LS0_1
#define SYSCTL_DC18_LS1_1         0x2U         // LS1_1
#define SYSCTL_DC18_LS2_1         0x4U         // LS2_1
#define SYSCTL_DC18_LS3_1         0x8U         // LS3_1
#define SYSCTL_DC18_LS4_1         0x10U        // LS4_1
#define SYSCTL_DC18_LS5_1         0x20U        // LS5_1

//*****************************************************************************
//
// The following are defines for the bit fields in the DC19 register
//
//*****************************************************************************
#define SYSCTL_DC19_LS0_2         0x1U         // LS0_2
#define SYSCTL_DC19_LS1_2         0x2U         // LS1_2
#define SYSCTL_DC19_LS2_2         0x4U         // LS2_2
#define SYSCTL_DC19_LS3_2         0x8U         // LS3_2
#define SYSCTL_DC19_LS4_2         0x10U        // LS4_2
#define SYSCTL_DC19_LS5_2         0x20U        // LS5_2

//*****************************************************************************
//
// The following are defines for the bit fields in the DC20 register
//
//*****************************************************************************
#define SYSCTL_DC20_GS0           0x1U         // GS0
#define SYSCTL_DC20_GS1           0x2U         // GS1
#define SYSCTL_DC20_GS2           0x4U         // GS2
#define SYSCTL_DC20_GS3           0x8U         // GS3
#define SYSCTL_DC20_GS4           0x10U        // GS4
#define SYSCTL_DC20_GS5           0x20U        // GS5
#define SYSCTL_DC20_GS6           0x40U        // GS6
#define SYSCTL_DC20_GS7           0x80U        // GS7
#define SYSCTL_DC20_GS8           0x100U       // GS8
#define SYSCTL_DC20_GS9           0x200U       // GS9
#define SYSCTL_DC20_GS10          0x400U       // GS10
#define SYSCTL_DC20_GS11          0x800U       // GS11
#define SYSCTL_DC20_GS12          0x1000U      // GS12
#define SYSCTL_DC20_GS13          0x2000U      // GS13
#define SYSCTL_DC20_GS14          0x4000U      // GS14
#define SYSCTL_DC20_GS15          0x8000U      // GS15

//*****************************************************************************
//
// The following are defines for the bit fields in the PERCNF1 register
//
//*****************************************************************************
#define SYSCTL_PERCNF1_ADC_A_MODE  0x1U         // ADC_A mode setting bit
#define SYSCTL_PERCNF1_ADC_B_MODE  0x2U         // ADC_B mode setting bit
#define SYSCTL_PERCNF1_ADC_C_MODE  0x4U         // ADC_C mode setting bit
#define SYSCTL_PERCNF1_ADC_D_MODE  0x8U         // ADC_D mode setting bit
#define SYSCTL_PERCNF1_USB_A_PHY  0x10000U     // USB_A_PHY

//*****************************************************************************
//
// The following are defines for the bit fields in the FUSEERR register
//
//*****************************************************************************
#define SYSCTL_FUSEERR_ALERR_S    0U
#define SYSCTL_FUSEERR_ALERR_M    0x1FU        // Efuse Autoload Error Status
#define SYSCTL_FUSEERR_ERR        0x20U        // Efuse Self Test Error Status

//*****************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES0 register
//
//*****************************************************************************
#define SYSCTL_SOFTPRES0_CPU1_CLA1  0x1U         // CPU1_CLA1 software reset bit
#define SYSCTL_SOFTPRES0_CPU2_CLA1  0x4U         // CPU2_CLA1 software reset bit

//*****************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES1 register
//
//*****************************************************************************
#define SYSCTL_SOFTPRES1_EMIF1    0x1U         // EMIF1 software reset bit
#define SYSCTL_SOFTPRES1_EMIF2    0x2U         // EMIF2 software reset bit

//*****************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES2 register
//
//*****************************************************************************
#define SYSCTL_SOFTPRES2_EPWM1    0x1U         // EPWM1 software reset bit
#define SYSCTL_SOFTPRES2_EPWM2    0x2U         // EPWM2 software reset bit
#define SYSCTL_SOFTPRES2_EPWM3    0x4U         // EPWM3 software reset bit
#define SYSCTL_SOFTPRES2_EPWM4    0x8U         // EPWM4 software reset bit
#define SYSCTL_SOFTPRES2_EPWM5    0x10U        // EPWM5 software reset bit
#define SYSCTL_SOFTPRES2_EPWM6    0x20U        // EPWM6 software reset bit
#define SYSCTL_SOFTPRES2_EPWM7    0x40U        // EPWM7 software reset bit
#define SYSCTL_SOFTPRES2_EPWM8    0x80U        // EPWM8 software reset bit
#define SYSCTL_SOFTPRES2_EPWM9    0x100U       // EPWM9 software reset bit
#define SYSCTL_SOFTPRES2_EPWM10   0x200U       // EPWM10 software reset bit
#define SYSCTL_SOFTPRES2_EPWM11   0x400U       // EPWM11 software reset bit
#define SYSCTL_SOFTPRES2_EPWM12   0x800U       // EPWM12 software reset bit

//*****************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES3 register
//
//*****************************************************************************
#define SYSCTL_SOFTPRES3_ECAP1    0x1U         // ECAP1 software reset bit
#define SYSCTL_SOFTPRES3_ECAP2    0x2U         // ECAP2 software reset bit
#define SYSCTL_SOFTPRES3_ECAP3    0x4U         // ECAP3 software reset bit
#define SYSCTL_SOFTPRES3_ECAP4    0x8U         // ECAP4 software reset bit
#define SYSCTL_SOFTPRES3_ECAP5    0x10U        // ECAP5 software reset bit
#define SYSCTL_SOFTPRES3_ECAP6    0x20U        // ECAP6 software reset bit

//*****************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES4 register
//
//*****************************************************************************
#define SYSCTL_SOFTPRES4_EQEP1    0x1U         // EQEP1 software reset bit
#define SYSCTL_SOFTPRES4_EQEP2    0x2U         // EQEP2 software reset bit
#define SYSCTL_SOFTPRES4_EQEP3    0x4U         // EQEP3 software reset bit

//*****************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES6 register
//
//*****************************************************************************
#define SYSCTL_SOFTPRES6_SD1      0x1U         // SD1 software reset bit
#define SYSCTL_SOFTPRES6_SD2      0x2U         // SD2 software reset bit

//*****************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES7 register
//
//*****************************************************************************
#define SYSCTL_SOFTPRES7_SCI_A    0x1U         // SCI_A software reset bit
#define SYSCTL_SOFTPRES7_SCI_B    0x2U         // SCI_B software reset bit
#define SYSCTL_SOFTPRES7_SCI_C    0x4U         // SCI_C software reset bit
#define SYSCTL_SOFTPRES7_SCI_D    0x8U         // SCI_D software reset bit

//*****************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES8 register
//
//*****************************************************************************
#define SYSCTL_SOFTPRES8_SPI_A    0x1U         // SPI_A software reset bit
#define SYSCTL_SOFTPRES8_SPI_B    0x2U         // SPI_B software reset bit
#define SYSCTL_SOFTPRES8_SPI_C    0x4U         // SPI_C software reset bit

//*****************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES9 register
//
//*****************************************************************************
#define SYSCTL_SOFTPRES9_I2C_A    0x1U         // I2C_A software reset bit
#define SYSCTL_SOFTPRES9_I2C_B    0x2U         // I2C_B software reset bit

//*****************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES11 register
//
//*****************************************************************************
#define SYSCTL_SOFTPRES11_MCBSP_A  0x1U         // McBSP_A software reset bit
#define SYSCTL_SOFTPRES11_MCBSP_B  0x2U         // McBSP_B software reset bit
#define SYSCTL_SOFTPRES11_USB_A   0x10000U     // USB_A software reset bit

//*****************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES13 register
//
//*****************************************************************************
#define SYSCTL_SOFTPRES13_ADC_A   0x1U         // ADC_A software reset bit
#define SYSCTL_SOFTPRES13_ADC_B   0x2U         // ADC_B software reset bit
#define SYSCTL_SOFTPRES13_ADC_C   0x4U         // ADC_C software reset bit
#define SYSCTL_SOFTPRES13_ADC_D   0x8U         // ADC_D software reset bit

//*****************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES14 register
//
//*****************************************************************************
#define SYSCTL_SOFTPRES14_CMPSS1  0x1U         // CMPSS1 software reset bit
#define SYSCTL_SOFTPRES14_CMPSS2  0x2U         // CMPSS2 software reset bit
#define SYSCTL_SOFTPRES14_CMPSS3  0x4U         // CMPSS3 software reset bit
#define SYSCTL_SOFTPRES14_CMPSS4  0x8U         // CMPSS4 software reset bit
#define SYSCTL_SOFTPRES14_CMPSS5  0x10U        // CMPSS5 software reset bit
#define SYSCTL_SOFTPRES14_CMPSS6  0x20U        // CMPSS6 software reset bit
#define SYSCTL_SOFTPRES14_CMPSS7  0x40U        // CMPSS7 software reset bit
#define SYSCTL_SOFTPRES14_CMPSS8  0x80U        // CMPSS8 software reset bit

//*****************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES16 register
//
//*****************************************************************************
#define SYSCTL_SOFTPRES16_DAC_A   0x10000U     // Buffered_DAC_A software reset
                                               // bit
#define SYSCTL_SOFTPRES16_DAC_B   0x20000U     // Buffered_DAC_B software reset
                                               // bit
#define SYSCTL_SOFTPRES16_DAC_C   0x40000U     // Buffered_DAC_C software reset
                                               // bit

//*****************************************************************************
//
// The following are defines for the bit fields in the CPUSEL0 register
//
//*****************************************************************************
#define SYSCTL_CPUSEL0_EPWM1      0x1U         // EPWM1 CPU select bit
#define SYSCTL_CPUSEL0_EPWM2      0x2U         // EPWM2 CPU select bit
#define SYSCTL_CPUSEL0_EPWM3      0x4U         // EPWM3 CPU select bit
#define SYSCTL_CPUSEL0_EPWM4      0x8U         // EPWM4 CPU select bit
#define SYSCTL_CPUSEL0_EPWM5      0x10U        // EPWM5 CPU select bit
#define SYSCTL_CPUSEL0_EPWM6      0x20U        // EPWM6 CPU select bit
#define SYSCTL_CPUSEL0_EPWM7      0x40U        // EPWM7 CPU select bit
#define SYSCTL_CPUSEL0_EPWM8      0x80U        // EPWM8 CPU select bit
#define SYSCTL_CPUSEL0_EPWM9      0x100U       // EPWM9 CPU select bit
#define SYSCTL_CPUSEL0_EPWM10     0x200U       // EPWM10 CPU select bit
#define SYSCTL_CPUSEL0_EPWM11     0x400U       // EPWM11 CPU select bit
#define SYSCTL_CPUSEL0_EPWM12     0x800U       // EPWM12 CPU select bit

//*****************************************************************************
//
// The following are defines for the bit fields in the CPUSEL1 register
//
//*****************************************************************************
#define SYSCTL_CPUSEL1_ECAP1      0x1U         // ECAP1 CPU select bit
#define SYSCTL_CPUSEL1_ECAP2      0x2U         // ECAP2 CPU select bit
#define SYSCTL_CPUSEL1_ECAP3      0x4U         // ECAP3 CPU select bit
#define SYSCTL_CPUSEL1_ECAP4      0x8U         // ECAP4 CPU select bit
#define SYSCTL_CPUSEL1_ECAP5      0x10U        // ECAP5 CPU select bit
#define SYSCTL_CPUSEL1_ECAP6      0x20U        // ECAP6 CPU select bit

//*****************************************************************************
//
// The following are defines for the bit fields in the CPUSEL2 register
//
//*****************************************************************************
#define SYSCTL_CPUSEL2_EQEP1      0x1U         // EQEP1 CPU select bit
#define SYSCTL_CPUSEL2_EQEP2      0x2U         // EQEP2 CPU select bit
#define SYSCTL_CPUSEL2_EQEP3      0x4U         // EQEP3 CPU select bit

//*****************************************************************************
//
// The following are defines for the bit fields in the CPUSEL4 register
//
//*****************************************************************************
#define SYSCTL_CPUSEL4_SD1        0x1U         // SD1 CPU select bit
#define SYSCTL_CPUSEL4_SD2        0x2U         // SD2 CPU select bit

//*****************************************************************************
//
// The following are defines for the bit fields in the CPUSEL5 register
//
//*****************************************************************************
#define SYSCTL_CPUSEL5_SCI_A      0x1U         // SCI_A CPU select bit
#define SYSCTL_CPUSEL5_SCI_B      0x2U         // SCI_B CPU select bit
#define SYSCTL_CPUSEL5_SCI_C      0x4U         // SCI_C CPU select bit
#define SYSCTL_CPUSEL5_SCI_D      0x8U         // SCI_D CPU select bit

//*****************************************************************************
//
// The following are defines for the bit fields in the CPUSEL6 register
//
//*****************************************************************************
#define SYSCTL_CPUSEL6_SPI_A      0x1U         // SPI_A CPU select bit
#define SYSCTL_CPUSEL6_SPI_B      0x2U         // SPI_B CPU select bit
#define SYSCTL_CPUSEL6_SPI_C      0x4U         // SPI_C CPU select bit

//*****************************************************************************
//
// The following are defines for the bit fields in the CPUSEL7 register
//
//*****************************************************************************
#define SYSCTL_CPUSEL7_I2C_A      0x1U         // I2C_A CPU select bit
#define SYSCTL_CPUSEL7_I2C_B      0x2U         // I2C_B CPU select bit

//*****************************************************************************
//
// The following are defines for the bit fields in the CPUSEL8 register
//
//*****************************************************************************
#define SYSCTL_CPUSEL8_CAN_A      0x1U         // CAN_A CPU select bit
#define SYSCTL_CPUSEL8_CAN_B      0x2U         // CAN_B CPU select bit

//*****************************************************************************
//
// The following are defines for the bit fields in the CPUSEL9 register
//
//*****************************************************************************
#define SYSCTL_CPUSEL9_MCBSP_A    0x1U         // McBSP_A CPU select bit
#define SYSCTL_CPUSEL9_MCBSP_B    0x2U         // McBSP_B CPU select bit

//*****************************************************************************
//
// The following are defines for the bit fields in the CPUSEL11 register
//
//*****************************************************************************
#define SYSCTL_CPUSEL11_ADC_A     0x1U         // ADC_A CPU select bit
#define SYSCTL_CPUSEL11_ADC_B     0x2U         // ADC_B CPU select bit
#define SYSCTL_CPUSEL11_ADC_C     0x4U         // ADC_C CPU select bit
#define SYSCTL_CPUSEL11_ADC_D     0x8U         // ADC_D CPU select bit

//*****************************************************************************
//
// The following are defines for the bit fields in the CPUSEL12 register
//
//*****************************************************************************
#define SYSCTL_CPUSEL12_CMPSS1    0x1U         // CMPSS1 CPU select bit
#define SYSCTL_CPUSEL12_CMPSS2    0x2U         // CMPSS2 CPU select bit
#define SYSCTL_CPUSEL12_CMPSS3    0x4U         // CMPSS3 CPU select bit
#define SYSCTL_CPUSEL12_CMPSS4    0x8U         // CMPSS4 CPU select bit
#define SYSCTL_CPUSEL12_CMPSS5    0x10U        // CMPSS5 CPU select bit
#define SYSCTL_CPUSEL12_CMPSS6    0x20U        // CMPSS6 CPU select bit
#define SYSCTL_CPUSEL12_CMPSS7    0x40U        // CMPSS7 CPU select bit
#define SYSCTL_CPUSEL12_CMPSS8    0x80U        // CMPSS8 CPU select bit

//*****************************************************************************
//
// The following are defines for the bit fields in the CPUSEL14 register
//
//*****************************************************************************
#define SYSCTL_CPUSEL14_DAC_A     0x10000U     // Buffered_DAC_A CPU select bit
#define SYSCTL_CPUSEL14_DAC_B     0x20000U     // Buffered_DAC_B CPU select bit
#define SYSCTL_CPUSEL14_DAC_C     0x40000U     // Buffered_DAC_C CPU select bit

//*****************************************************************************
//
// The following are defines for the bit fields in the CPU2RESCTL register
//
//*****************************************************************************
#define SYSCTL_CPU2RESCTL_RESET   0x1U         // CPU2 Reset Control bit
#define SYSCTL_CPU2RESCTL_KEY_S   16U
#define SYSCTL_CPU2RESCTL_KEY_M   0xFFFF0000U  // Key Qualifier for writes to
                                               // this register

//*****************************************************************************
//
// The following are defines for the bit fields in the RSTSTAT register
//
//*****************************************************************************
#define SYSCTL_RSTSTAT_CPU2RES    0x1U         // CPU2 Reset Status bit
#define SYSCTL_RSTSTAT_CPU2NMIWDRST  0x2U         // Indicates whether a
                                               // CPU2.NMIWD reset was issued to CPU2
#define SYSCTL_RSTSTAT_CPU2HWBISTRST0  0x4U         // Indicates whether a HWBIST
                                               // reset was issued to CPU2
#define SYSCTL_RSTSTAT_CPU2HWBISTRST1  0x8U         // Indicates whether a HWBIST
                                               // reset was issued to CPU2

//*****************************************************************************
//
// The following are defines for the bit fields in the LPMSTAT register
//
//*****************************************************************************
#define SYSCTL_LPMSTAT_CPU2LPMSTAT_S  0U
#define SYSCTL_LPMSTAT_CPU2LPMSTAT_M  0x3U         // CPU2 LPM Status

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSDBGCTL register
//
//*****************************************************************************
#define SYSCTL_SYSDBGCTL_BIT_0    0x1U         // Used in PLL startup. Only
                                               // reset by POR.

//*****************************************************************************
//
// The following are defines for the bit fields in the CLKSEM register
//
//*****************************************************************************
#define SYSCTL_CLKSEM_SEM_S       0U
#define SYSCTL_CLKSEM_SEM_M       0x3U         // Semaphore for CLKCFG
                                               // Ownership by CPU1 or CPU2
#define SYSCTL_CLKSEM_KEY_S       16U
#define SYSCTL_CLKSEM_KEY_M       0xFFFF0000U  // Key Qualifier for writes to
                                               // this register

